from pyecharts.charts import Geo, Graph
from pyecharts import options as opts
from pyecharts.charts import Map

# 百度地图坐标拾取系统，http://api.map.baidu.com/lbsapi/getpoint/index.html
destination = [
    ('白巴哈', (86.804051,48.695714)),
    ('贾登峪国家森林公园', (87.177628,48.497579)),
    ('哈巴河', (86.424818, 48.066149)),
    ('冲乎尔', (87.137852,48.122648)),
    ('布尔津', (86.88136, 47.707952)),
    ('北屯', (87.843466, 47.338865)),
    ('塔城', (82.993557, 46.757383)),
    ('额敏', (83.633374, 46.531885)),
    ('富蕴', (89.531953, 46.999951)),
    ('裕民', (82.989439, 46.207454)),
    ('乌尔禾', (85.700305, 46.095295)),
    ('托里', (83.612909, 45.942743)),
    ('阿拉山口', (82.560725, 45.17967)),
    ('克拉玛依', (84.874295, 45.608471)),
    ('博乐', (82.057972, 44.86001)),
    ('精河', (82.900655, 44.606646)),
    ('果子沟', (81.174523,44.465576)),
    ('奎屯', (84.909449, 44.432057)),
    ('沙湾', (85.637971,44.333301)),
    ('霍尔果斯', (80.42713, 44.235309)),
    ('伊宁', (81.284242, 43.915299)),
    ('霍城', (80.885281, 44.06225)),
    ('尼勒克', (82.518008, 43.804595)),
    ('乔尔玛', (84.344562,43.667735)),
    ('乌鲁木齐', (87.416029, 43.477086)),
    ('独山子', (84.893613, 44.334407)),
    ('石河子', (86.086886, 44.311976)),
    ('阜康', (87.993678, 44.163137)),
    ('奇台', (89.601081, 44.026898)),
    ('木垒', (90.290789,43.845927)),
    ('巴里坤', (93.038454,43.60548)),
    ('昭苏', (81.135654,43.165811)),
    ('反修桥', (84.960133,43.140168)),
    ('和硕', (86.883689, 42.288065)),
    ('巴仑台', (86.320071,42.755331)),
    ('托克逊', (88.660164, 42.798546)),
    ('达坂城', (88.317398, 43.369943)),
    ('吐鲁番', (89.189825,42.95804)),
    ('鄯善', (90.220094, 42.874759)),
    ('哈密', (93.512588,42.830693)),
    ('星星峡', (95.140532,41.799498)),
    ('库尔勒', (86.181494, 41.732373)),
    ('轮台', (84.258212, 41.783813)),
    ('阿图什市', (76.174906, 39.722079)),
    ('阿克苏', (80.269927, 41.17386)),
    ('库车', (82.968459, 41.723448)),
    ('34团', (87.702885,40.655481)),
    ('36团', (88.908672,39.248695)),
    ('和田', (79.920212, 37.118336)),
    ('于田', (81.683783, 36.862954)),
    ('民丰', (82.702713, 37.070257)),
    ('塔中镇', (83.637745,39.042402)),
    ('且末县', (85.531962,38.151161)),
    ('喀什市', (76.000313, 39.47365)),
    ('依吞布拉克', (90.16637,38.399114)),
    ('若羌', (88.175324, 39.028991)),
    ('布伦口', (74.958314,38.668998)),
    ('大柴旦', (95.362336,37.860866)),
    ('塔什库尔干', (75.22793,37.780643)),
    ('红其拉甫', (75.552982,36.974029)),
    ('莎车', (77.252437, 38.420157)),
    ('嘉峪关', (98.296204, 39.77796)),
    ('张掖', (100.456984,38.932739)),
    ('武威', (102.64858,37.936882)),
    ('花土沟', (90.863822,38.258336)),
    ('格尔木', (94.929289,36.408422)),
    ('西宁', (101.785021,36.628251)),
    ('乌兰', (98.486736,36.935748)),
    ('兰州', (103.843399,36.065134))
]


city_names = [name for name, _ in destination]
coordinates = [coord for _, coord in destination]

# 创建Geo实例
geo = Geo()
geo.add_schema(maptype="china")

# 创建Graph实例
graph = Graph()

# 高速公路数据
highway_data = [
    ('独山子', '库车'),
    # 其他高速公路数据...
]

nodes = []
links = []

# 添加高速公路线条
for source, target in highway_data:
    if source not in nodes:
        nodes.append(source)
    if target not in nodes:
        nodes.append(target)
    links.append({"source": source, "target": target})

# 添加位置和对应的经纬度坐标
for name, (lng, lat) in destination:
    geo.add_coordinate(name, lng, lat)
    # graph.add(name, [(name, 0)], symbol_size=10)  # 添加节点

# 添加高速公路线条
graph.add("", nodes, links)

# 绘制地图
geo.add("自驾游目的地", 
        destination, 
        type_="scatter",
        symbol_size=10,
        effect_opts=opts.EffectOpts(),
        label_opts=opts.LabelOpts(formatter="{b}", position="right", is_show=False),
        itemstyle_opts=opts.ItemStyleOpts(color="purple"),
    )
geo.add_schema(
    # baidu_ak="15bKtTqehCDWOMdxwPEPUHc6GjA0sjQO",
    center=[104.114129, 37.550339],
    zoom=5,
    is_roam=True
)
# 不显示坐标位置名称
# geo.set_series_opts(label_opts=opts.LabelOpts(is_show=False))
# 显示坐标位置名称
geo.set_series_opts(
    label_opts=opts.LabelOpts(is_show=True, formatter="{b}"),  # 设置显示位置名称
    tooltip_opts=opts.TooltipOpts(formatter="{b}"),
)
geo.set_global_opts(title_opts=opts.TitleOpts(title="自定义旅游线路图"))

# 叠加线条到地图上, 将地图保存为HTML文件
# geo.overlap(graph).render("custom_travel_route_map.html")
geo.render("custom_travel_route_map.html")